In [1]:
import pandas as pd

In [2]:
transactions = pd.read_csv(r'..\data\raw\transactions_large.csv')
transactions.head()

  transaction_id  customer_id  visit_date  total_spending
0        T004000         1390  2023-01-01          265869
1        T002563         1276  2023-01-01           74918
2        T000553         1130  2023-01-01          161868
3        T005176         1196  2023-01-01           64898
4        T007017         1336  2023-01-01          316389

In [3]:
transactions.info()
transactions.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8000 entries, 0 to 7999
Data columns (total 4 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   transaction_id  8000 non-null   object
 1   customer_id     8000 non-null   int64
 2   visit_date      8000 non-null   object
 3   total_spending  8000 non-null   int64
dtypes: int64(2), object(2)
memory usage: 250.1+ KB

       customer_id  total_spending
count  8000.000000     8000.000000
mean   1251.296625   259039.996750
std     144.849374   139306.085692
min    1001.000000    20018.000000
25%    1125.000000   138160.500000
50%    1251.000000   257296.000000
75%    1379.000000   381402.500000
max    1500.000000   499969.000000

In [4]:
customers = pd.read_csv(r'..\data\raw\customers_large.csv')
customers.head()

   customer_id customer_name gender      city registration_date
0         1001    Customer_1      M      Solo        2022-11-26
1         1002    Customer_2      F      Solo        2023-05-23
2         1003    Customer_3      M   Jakarta        2022-03-10
3         1004    Customer_4      M  Surabaya        2023-06-30
4         1005    Customer_5      M   Bandung        2022-02-22

In [5]:
customers.info()
customers.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 500 entries, 0 to 499
Data columns (total 5 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   customer_id        500 non-null    int64
 1   customer_name      500 non-null    object
 2   gender             500 non-null    object
 3   city               500 non-null    object
 4   registration_date  500 non-null    object
dtypes: int64(1), object(4)
memory usage: 19.7+ KB

       customer_id
count   500.000000
mean   1250.500000
std     144.481833
min    1001.000000
25%    1125.750000
50%    1250.500000
75%    1375.250000
max    1500.000000